<a href="https://colab.research.google.com/github/javilledo/machine-learning/blob/master/notebooks/t01_02_data_cleaning_an%C3%A1lisis_preliminar_de_los_datos.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

#RESUMEN DE LOS DATOS, DIMENSIONES Y ESTRUCTURAS

In [8]:
# CARGA DE LIBRERÍAS
import pandas as pd

# CARGA DE DATOS DESDE ARCHIVO
mainpath = '/content/'
filename = 'titanic3.csv'
fullpath = mainpath + filename
data = pd.read_csv(fullpath)

# CARGA DE DATOS DESDE URL
url = 'https://raw.githubusercontent.com/javilledo/python-ml-course/master/datasets/titanic/titanic3.csv'
data = pd.read_csv(url)

In [9]:
data.head() # datos iniciales, se le puede poner en el paréntesis la cantidad

   pclass  survived  ...   body                        home.dest
0       1         1  ...    NaN                     St Louis, MO
1       1         1  ...    NaN  Montreal, PQ / Chesterville, ON
2       1         0  ...    NaN  Montreal, PQ / Chesterville, ON
3       1         0  ...  135.0  Montreal, PQ / Chesterville, ON
4       1         0  ...    NaN  Montreal, PQ / Chesterville, ON

[5 rows x 14 columns]

In [11]:
data.tail() # datos finales, se le puede poner en el paréntesis la cantidad

      pclass  survived                       name  ... boat   body  home.dest
1304       3         0       Zabour, Miss. Hileni  ...  NaN  328.0        NaN
1305       3         0      Zabour, Miss. Thamine  ...  NaN    NaN        NaN
1306       3         0  Zakarian, Mr. Mapriededer  ...  NaN  304.0        NaN
1307       3         0        Zakarian, Mr. Ortin  ...  NaN    NaN        NaN
1308       3         0         Zimmerman, Mr. Leo  ...  NaN    NaN        NaN

[5 rows x 14 columns]

In [10]:
data.shape # tamaño de los datos

(1309, 14)

In [13]:
data.columns.values # valores de los campos

array(['pclass', 'survived', 'name', 'sex', 'age', 'sibsp', 'parch',
       'ticket', 'fare', 'cabin', 'embarked', 'boat', 'body', 'home.dest'],
      dtype=object)

# RESUMEN DE ESTADÍSTICOS BÁSICOS DE LAS VARIABLES NUMÉRICAS

In [14]:
data.describe() # estadísticos básicos

            pclass     survived  ...         fare        body
count  1309.000000  1309.000000  ...  1308.000000  121.000000
mean      2.294882     0.381971  ...    33.295479  160.809917
std       0.837836     0.486055  ...    51.758668   97.696922
min       1.000000     0.000000  ...     0.000000    1.000000
25%       2.000000     0.000000  ...     7.895800   72.000000
50%       3.000000     0.000000  ...    14.454200  155.000000
75%       3.000000     1.000000  ...    31.275000  256.000000
max       3.000000     1.000000  ...   512.329200  328.000000

[8 rows x 7 columns]

In [16]:
data.dtypes # tipos de datos de cada variable

pclass         int64
survived       int64
name          object
sex           object
age          float64
sibsp          int64
parch          int64
ticket        object
fare         float64
cabin         object
embarked      object
boat          object
body         float64
home.dest     object
dtype: object